jackeyjiang/STM32_DGUS/STM32_Demo/utilities/szt_Gpboc/szt_gpboc.c
#include "stm32f4xx.h"
#include "szt_gpboc.h"
#include "bsp.h"
#include "rtc.h"

sendorderDef SztSendData;
sendorderDef GpbocSendData;
uint8_t MustSendData[21]; //必须要发送的数据
uint8_t  AckOver; //Ack数据是否接收完
uint8_t  DataOver;//返回数据是否接收完
uint8_t  Usart2Flag;//数据类型，分为 无数据：0、Ack：1、data：2

uint8_t PrintBuf2[640];
uint32_t PrintIndex2;

uint8_t SztSamNum[4]; //深圳通Sam卡号
uint8_t GpbocSamNum[4];//银联Sam卡号
uint8_t UserNo[3] = {0x00,0x01,0x23};//操作员编号,BCD码,3位,如123表示为0x00,0x01,0x23
uint8_t newtime[8];//同步 时间值，
uint8_t timeMode;//同步方式，0为一般同步；1为强制同步
extern Struct_TD TimeDate ;		 //系统时间，共7Data
uint8_t SztReadCardTime; //深圳通读卡时间

/*银联初始化输入参数，共32个，除了第一个数要作修改外，其它的都为保留字，全为0
第一个数表示收单行个数，默认为0x00，表示一个收单行“银联";
若非0时，如 0x01一个收单行，银联；0x02：两个收单行，银联&商联商用；
*/
uint8_t Gpboc_Init_PutInParameter[32] ={
0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
} ;

/* 银联上传参数共32个，都为预留值0x00*/
uint8_t Gpboc_SendDataParameter[32] = {
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00	
};


/*银联批结、签退的参数共32个，都为预留值0x00*/
uint8_t Gpboc_CheckOutParameter[32] = {
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00	
};

DeviceInf Szt_deviceInf; //深圳通状态查询返回值

uint8_t TimeResult;	 //时间同步的结果
MachineTimeDef MachineTime;	  //当前设备时间

SztReductInfStr SztReductInf;	//深圳通扣款返回值
SztReadCardInfStr SztCardInf;	//深圳通读卡返回值

GpbocInitInf UpInitData[10];   //定义10个银联签到内容结构体
uint8_t UpInitErrNum[2];	   //银联返回错误
uint8_t UpInitGpbocErrNum[2];  //银联错误
GpbocReadCardInf UpReadCardData;  //读卡返回内容
TRANSLOG_TO_HOST UpDeductData;	//银联扣款交易内容
//uint8_t UpDedectBackup[600];  //一个灾难备份数据
UPLOADLOG_TO_HOS UpSendData;   //银联上传数据返回结构体
LOGINLOG_TO_HOST UpCheckOutData; //银联批结返回结构体

//交易成功次数记数，达到要求次数后上送银联数据，上送完了之后此数归0
uint8_t freq_toSendGpboc;
//交易成功次数记数，达到要求次数后上送深圳通数据，上送完了之后此数归0
uint8_t freq_toSendSzt;


//extern u32 tmp_hh = 0x17, tmp_mm = 0x3b, tmp_ss = 0x01;
//extern u32 tmp_yy = 0x09, tmp_m2 = 0x01, tmp_dd = 0x01,tmp_ww=0x01;
/***************
串口2作为深圳通、银联刷卡通道
****************/



/*打开深圳通\银联通道*/
void Open_Szt_Gpboc(void)
{
  USART_Cmd(USART2,ENABLE);
  //USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
}

/*关闭深圳通\银联通道*/
void Close_Szt_Gpboc(void)
{
  USART_Cmd(USART2,DISABLE);
  //USART_ITConfig(USART2, USART_IT_RXNE, DISABLE);
}



/*回正确应答:ACK*/
void return_ACK(void)
{
   uint8_t ackdata[6] = {DataHead,BeginCode1,BeginCode2,0x00,0xff,EndCode};
   uint8_t i;

   for(i=0;i<6;i++)
   {
     USART_SendData(USART2,ackdata[i]);
	 while( USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET);//等待发送完成
   }
}


/*回错误应答:NACK*/
void return_NACK(void)
{
  uint8_t nackdata[6] = {DataHead,BeginCode1,BeginCode2,0xff,0x00,EndCode};
  uint8_t i;

  for(i=0;i<6;i++)
  {
    USART_SendData(USART2,nackdata[i]);
	while( USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET);//等待发送完成
  }
}




/*深圳通固定用到的数据，输入参数为从saddr开始到Dcs之前所有的数据长度，以及命令类型*/
void SztFixData(uint8_t LenH,uint8_t LenL,uint8_t OrderNum)
{
  SztSendData.datahead = DataHead;
  SztSendData.startPacket[0] = BeginCode1;
  SztSendData.startPacket[1] = BeginCode2;
  SztSendData.dataLen[0] = LenH;
  SztSendData.dataLen[1] = LenL;
  SztSendData.saddr[0] = 0x06;
  SztSendData.saddr[1] = 0xff;
  SztSendData.saddr[2] = 0xff;
  SztSendData.saddr[3] = 0xff;
  SztSendData.saddr[4] = 0xff;
  SztSendData.taddr[0] = 0x05;
  SztSendData.taddr[1] = SztSamNum[0];
  SztSendData.taddr[2] = SztSamNum[1];
  SztSendData.taddr[3] = SztSamNum[2];
  SztSendData.taddr[4] = SztSamNum[3];
  SztSendData.startNum ++ ; //再改过
  SztSendData.SendCommand = OrderNum;
  SztSendData.plen1[0] = 0x00;
  SztSendData.plen1[1] = 0x01;
  SztSendData.plen2[0] = 0x00;
  SztSendData.plen2[1] = 0x01;
  SztSendData.dataend = 0x00;

  MustSendData[0] = SztSendData.datahead ;
  MustSendData[1] =   SztSendData.startPacket[0];
  MustSendData[2] =   SztSendData.startPacket[1];
  MustSendData[3] =   SztSendData.dataLen[0];
  MustSendData[4] =   SztSendData.dataLen[1];
  MustSendData[5] =   SztSendData.saddr[0];
  MustSendData[6] =   SztSendData.saddr[1];
  MustSendData[7] =   SztSendData.saddr[2];
  MustSendData[8] =   SztSendData.saddr[3];
  MustSendData[9] =   SztSendData.saddr[4];
  MustSendData[10] =   SztSendData.taddr[0];
  MustSendData[11] =   SztSendData.taddr[1];
  MustSendData[12] =   SztSendData.taddr[2];
  MustSendData[13] =   SztSendData.taddr[3];
  MustSendData[14] =   SztSendData.taddr[4];
  MustSendData[15] =   SztSendData.startNum;
  MustSendData[16] =   SztSendData.SendCommand;
  MustSendData[17] =   SztSendData.plen1[0];
  MustSendData[18] =   SztSendData.plen1[1];
  MustSendData[19] =   SztSendData.plen2[0];
  MustSendData[20] =   SztSendData.plen2[1];
}




/* 银联固定用到的数据，输入参数为从saddr开始到Dcs之前所有的数据长度，以及命令类型,
对比深圳通，银联没用Sam卡，taddr全为0xff，若有Sam卡，taddr就用Sam卡号*/
void GpbocFixData(uint8_t LenH,uint8_t LenL,uint8_t OrderNum)
{
  GpbocSendData.datahead = DataHead;
  GpbocSendData.startPacket[0] = BeginCode1;
  GpbocSendData.startPacket[1] = BeginCode2;
  GpbocSendData.dataLen[0] = LenH;
  GpbocSendData.dataLen[1] = LenL;
  GpbocSendData.saddr[0] = 0x06;
  GpbocSendData.saddr[1] = 0xff;
  GpbocSendData.saddr[2] = 0xff;
  GpbocSendData.saddr[3] = 0xff;
  GpbocSendData.saddr[4] = 0xff;
  GpbocSendData.taddr[0] = 0x05;
  GpbocSendData.taddr[1] = GpbocSamNum[0];
  GpbocSendData.taddr[2] = GpbocSamNum[1];
  GpbocSendData.taddr[3] = GpbocSamNum[2];
  GpbocSendData.taddr[4] = GpbocSamNum[3];
  SztSendData.startNum ++;//再改过
  GpbocSendData.SendCommand = OrderNum;
  GpbocSendData.plen1[0] = 0x00;
  GpbocSendData.plen1[1] = 0x01;
  GpbocSendData.plen2[0] = 0x00;
  GpbocSendData.plen2[1] = 0x01;
  GpbocSendData.dataend = 0x00;

  MustSendData[0] = GpbocSendData.datahead ;
  MustSendData[1] =   GpbocSendData.startPacket[0];
  MustSendData[2] =   GpbocSendData.startPacket[1];
  MustSendData[3] =   GpbocSendData.dataLen[0];
  MustSendData[4] =   GpbocSendData.dataLen[1];
  MustSendData[5] =   GpbocSendData.saddr[0];
  MustSendData[6] =   GpbocSendData.saddr[1];
  MustSendData[7] =   GpbocSendData.saddr[2];
  MustSendData[8] =   GpbocSendData.saddr[3];
  MustSendData[9] =   GpbocSendData.saddr[4];
  MustSendData[10] =   GpbocSendData.taddr[0];
  MustSendData[11] =   GpbocSendData.taddr[1];
  MustSendData[12] =   GpbocSendData.taddr[2];
  MustSendData[13] =   GpbocSendData.taddr[3];
  MustSendData[14] =   GpbocSendData.taddr[4];
  MustSendData[15] =   SztSendData.startNum;
  MustSendData[16] =   GpbocSendData.SendCommand;
  MustSendData[17] =   GpbocSendData.plen1[0];
  MustSendData[18] =   GpbocSendData.plen1[1];
  MustSendData[19] =   GpbocSendData.plen2[0];
  MustSendData[20] =   GpbocSendData.plen2[1];
}


/*判断接收的数据是ACK还是NACK*/
uint8_t ManageACK(void)
{
  uint8_t i;
  if(( PrintBuf2[0] == 0x00) && ( PrintBuf2[1] == 0x00) &&( PrintBuf2[2] == 0xff ) && (PrintBuf2[3] == 0x00 ) && (PrintBuf2[4] ==0xff ) && (PrintBuf2[5] ==0x00 ))
  {
    return IsAck;
  }
  else if(( PrintBuf2[0] == 0x00) && ( PrintBuf2[1] == 0x00) &&( PrintBuf2[2] == 0xff ) && (PrintBuf2[3] == 0xff ) && (PrintBuf2[4] ==0x00 ) && (PrintBuf2[5] ==0x00 ))
  {
    return IsNack;
  }
  else
  {
    //printf("\ndata is :");
	for(i=0;i<6;i++)
	{
	  //printf(" %x ",PrintBuf2[i]); 
	}
    return IsAckError;
  }

