jackeyjiang/STM32_DGUS/STM32_Demo/utilities/szt_Gpboc/szt_gpboc.c
}


/*对比接收到的数据，判断其是否完整*/
uint8_t ManageRxData(void)
{
   uint16_t i;
   uint8_t sumdata =0;

   /*
   for( i=0;i<((UsartBuff[9]<< 8) + UsartBuff[10] +7);i++)
   {
     //printf(" %x ",UsartBuff[i]);  //打印所有接收到的数据
   }
   */
   for( i=0;i<((PrintBuf2[9]<< 8) + PrintBuf2[10] +1);i++)
   {
     sumdata = sumdata + PrintBuf2[11+i]; //从第12个数开始相加，一直加到校验值
   }

   if(( sumdata == 0 ) && ( PrintBuf2[6] == 0x00) && (PrintBuf2[7] == 0x00) &&(PrintBuf2[8] == 0xff ) && (PrintBuf2[PrintIndex2 - 1] == 0x00))
   {
     return_ACK();
	 return DataReOk;
   }
   else
   {
     return_NACK();
	 return DataReErr;
   }
}




/*解析返回的时什么命令，若返回值为0，则接收到的数无效*/
uint8_t ManageReOrderType(void)
{
  uint32_t temp;  //定时临时计数值
  uint8_t  ackflagbuff = IsNc;
  uint8_t  dataflagbuff = DataNc;
  uint8_t  orderType = 0 ;

  
  //Open_Szt_Gpboc();
  delay_us(5);
  
  //Order_Ifn_QueryStatus(); //发送设备状态查询命令

  while(1) //等待有Ack信号或超时
  {
    if(( Usart2Flag == AckFlag ) || ( AckOver == RxOk ))
	{
	  break;
	}
	temp ++;
	delay_us(50);
	if( temp >= 0x0fff0 )
	{
	  //printf("\n等待有ack信号超时\n");
	  break;
	}
  }

  //printf("\n等待进入Ack接收时间:%d \n",temp );

  temp =0;
  while(1)	// 等待ACK接收结束或超时
  {
    if( AckOver == RxOk )
	{
	  break;
	}
	temp ++;
	delay_us(50);
	if( temp >= 0x0fff0 )
	{
	  //printf("\n接收完Ack超时\n");
	  break;
	}
  }
  //printf("\n接收完Ack时间:%d\n",temp);

  ackflagbuff = ManageACK();
  if( ackflagbuff == IsNc)
  {
    //printf("\n无发送数据\n");
  }
  else if(ackflagbuff == IsAck)
  {
    //printf("\n发送数据完整\n");
  }
  else if( ackflagbuff == IsNack)
  {
     //printf("\n发送数据不完整\n");
  }
  else
  {
     //printf("\n发送数据错误,ack处理值为：%d\n",ackflagbuff);
  }

  if( ackflagbuff == IsAck )
  	{
  	  
	  temp =0;
		while(1) //等待接收的为返回的数据或超时
		{
		  if( Usart2Flag == DataFlag )
		  {
			break;
		  }
		  temp ++;
		  delay_us(50);
		  if( temp >= 0x0fff0 )
		  {
			//printf("\n进入数据接收状态超时\n");
			break;
		  }
		}
		//printf("\n进入数据接收状态时间:%d\n",temp);
	  
	  
		temp =0;
		while(1) //等待接收完所有的数据或超时
		{
		  if( DataOver == RxOk )
		  {
			break;
		  }
		  temp ++;
		  delay_us(50);
		  if( temp >= 0x0fff0 )
		  {
			//printf("\n接收完所有数据超时\n");
			break;
		  }
		}
		//printf("\n接收完数据时间:%d\n",temp);
	  
		dataflagbuff = ManageRxData();//判断接收到的数据是否完整
	  
		/*判断返回的数据并处理*/
		if( dataflagbuff == DataNc)
		{
		  //printf("\n接收不到返回数据\n");
		}
		else if( dataflagbuff == DataReOk)
		{
		   //printf("\n返回数据完整\n");
		   
		   orderType = PrintBuf2[22];  
		}
		else if( dataflagbuff == DataReErr)
		{
		   //printf("\n返回数据不完整\n");
		}
		else 
		{
		   //printf("\n返回数据错误,数据处理的结果为%d\n",dataflagbuff);
		}
  	}
  //printf("\nPrintIndex2= %d",PrintIndex2);
	//printf("\n返回命令值为：%x",orderType);
  
  //Close_Szt_Gpboc();

  return orderType;
}



/*发送设备状态查询命令*/
void Order_Ifn_QueryStatus(void)
{
  uint8_t data[23];
  uint8_t i;
  uint8_t temp=0;

  SztSamNum[0] = 0;
  SztSamNum[1] = 0;
  SztSamNum[2] = 0;
  SztSamNum[3] = 0;
  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;

 
  delay_us(5);
  
  SztFixData(0x00,0x10,T_QueryStatus); //必须要发送的数据
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];		  //把必须要发送的数据写入数组中
  }
  
  for(i=0;i<16;i++)			 //计算要校验的数据的和
  {
    temp = temp + data[5+i];
  }

  data[21] = 0 - temp;		   //求检验码，此数+要校验的数据的和 = 0
  data[22] = SztSendData.dataend;	   //结束码
  //printf(" %x ",data[21]);
  
  

  for(i=0;i<23;i++)			 //发送设备状态查询命令
  {
    USART_ClearFlag(USART2,USART_FLAG_TC);
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
  /*
  for(i=0;i<23;i++)
  {
     printf(" %x ",data[i]);
  }
  */
}






/*发送深圳通操作员登录命令*/
void Order_SztUserLogin(void)
{
  uint8_t data[26];
  uint8_t i;
  uint8_t temp=0;

  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;

 
  delay_us(5);
  
  SztFixData(0x00,0x13,T_UserLogin); //必须要发送的数据
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];		  //把必须要发送的数据写入数组中
  }

  for(i=0;i<3;i++)
  	{
  	  data[21+i] = UserNo[i];
  	}
  
  for(i=0;i<19;i++)			 //计算要校验的数据的和
  {
    temp = temp + data[5+i];
  }

  data[24] = 0 - temp;		   //求检验码，此数+要校验的数据的和 = 0
  data[25] = SztSendData.dataend;	   //结束码
  //printf(" %x ",data[21]);
  
  

  for(i=0;i<26;i++)			 //发送深圳通操作员登录命令
  {
    //USART_ClearFlag(USART2,USART_FLAG_TC);
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
  /*
  for(i=0;i<26;i++)
  {
     printf(" %x ",data[i]);
  }
  */
}






/*发送深圳通时钟同步命令*/
void Order_SztTimeCheck(void)
{
  uint8_t data[32];
  uint8_t i;
  uint8_t temp=0;

  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;

 
  delay_us(5);
  
  SztFixData(0x00,0x19,T_TimeCheck); //必须要发送的数据
  
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];		  //把必须要发送的数据写入数组中
  }
  /*
  for(i=0;i<8;i++)
  	{
  	  data[21+i] = newtime[i];
  	}
	*/
	RTC_TimeShow();

  data[21] = Year_Frist;
  data[22] = DectoBCD(TimeDate.Year);
  data[23] = DectoBCD(TimeDate.Month);
  data[24] = DectoBCD(TimeDate.Date);
  data[25] = DectoBCD(TimeDate.Hours);
  data[26] = DectoBCD(TimeDate.Minutes);
  data[27] = DectoBCD(TimeDate.Senconds);
  data[28] = DectoBCD(TimeDate.WeekDay);

  data[29] = timeMode;  //时间同步方式
  //printf("\n系统时钟为:%x%x-%x-%x %x:%x:%x",data[21],data[22],data[23],data[24],data[25],data[26],data[27],data[28]);
  for(i=0;i<25;i++)			 //计算要校验的数据的和
  {
    temp = temp + data[5+i];
  }

  data[30] = 0 - temp;		   //求检验码，此数+要校验的数据的和 = 0
  data[31] = SztSendData.dataend;	   //结束码
  //printf(" %x ",data[21]);
  
  

  for(i=0;i<32;i++)			 //发送深圳通时间同步命令
  {
    //USART_ClearFlag(USART2,USART_FLAG_TC);
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
  /*
  for(i=0;i<32;i++)
  {
     printf(" %x ",data[i]);
  }
  */
}






/*发送深圳通首次扣款命令，输入参数为扣款金额*/
void Order_SztDeductOnce(int32_t money)
{
  uint8_t data[34];
  uint8_t i;
  uint8_t temp=0;

  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;

 
  delay_us(5);
  
  SztFixData(0x00,0x1B,T_SztDeductOnce); //必须要发送的数据
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];		  //把必须要发送的数据写入数组中
  }

