jackeyjiang/STM32_DGUS/STM32_Demo/utilities/szt_Gpboc/szt_gpboc.c
  data[21] = money;
  data[22] = money>>8;
  data[23] = money>>16;
  data[24] = money>>24;

  /*

  for(i=0;i<7;i++)  //扣款时间
  	{
  	  data[25+i] = newtime[i];
  	}
  */
  //扣款时间
  	RTC_TimeShow();
  data[25] = Year_Frist;;
  data[26] = DectoBCD(TimeDate.Year);
  data[27] = DectoBCD(TimeDate.Month);
  data[28] = DectoBCD(TimeDate.Date);
  data[29] = DectoBCD(TimeDate.Hours);
  data[30] = DectoBCD(TimeDate.Minutes);
  data[31] = DectoBCD(TimeDate.Senconds);
  
  //printf("\n扣款时间为:%x%x-%x-%x %x:%x:%x",data[25],data[26],data[27],data[28],data[29],data[30],data[31]);

  for(i=0;i<27;i++)			 //计算要校验的数据的和
  {
    temp = temp + data[5+i];
  }

  data[32] = 0 - temp;		   //求检验码，此数+要校验的数据的和 = 0
  data[33] = SztSendData.dataend;	   //结束码
  //printf(" %x ",data[21]);
  
  

  for(i=0;i<34;i++)			 //发送深圳通时间同步命令
  {
    //USART_ClearFlag(USART2,USART_FLAG_TC);
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
  /*
  for(i=0;i<34;i++)
  {
     printf(" %x ",data[i]);
  }
  */
}





/*发送深圳通再次扣款命令，输入参数为扣款金额*/
void Order_SztDeductAgain(int32_t money)
{
  uint8_t data[34];
  uint8_t i;
  uint8_t temp=0;

  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;

 
  delay_us(5);
  
  SztFixData(0x00,0x1B,T_SztDeductAgain); //必须要发送的数据
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];		  //把必须要发送的数据写入数组中
  }

  data[21] = money;
  data[22] = money>>8;
  data[23] = money>>16;
  data[24] = money>>24;
  
  /*
  for(i=0;i<7;i++)  //扣款时间
  	{
  	  data[25+i] = newtime[i];
  	}
  	*/
  //扣款时间
  	RTC_TimeShow();
  data[25] = Year_Frist;;
  data[26] = DectoBCD(TimeDate.Year);
  data[27] = DectoBCD(TimeDate.Month);
  data[28] = DectoBCD(TimeDate.Date);
  data[29] = DectoBCD(TimeDate.Hours);
  data[30] = DectoBCD(TimeDate.Minutes);
  data[31] = DectoBCD(TimeDate.Senconds);
  
  //printf("\n扣款时间为:%x%x-%x-%x %x:%x:%x",data[25],data[26],data[27],data[28],data[29],data[30],data[31]);

  for(i=0;i<27;i++)			 //计算要校验的数据的和
  {
    temp = temp + data[5+i];
  }

  data[32] = 0 - temp;		   //求检验码，此数+要校验的数据的和 = 0
  data[33] = SztSendData.dataend;	   //结束码
  //printf(" %x ",data[21]);
  
  

  for(i=0;i<34;i++)			 //发送深圳通时间同步命令
  {
    //USART_ClearFlag(USART2,USART_FLAG_TC);
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
  /*
  for(i=0;i<34;i++)
  {
     printf(" %x ",data[i]);
  }
  */
}





/*发送深圳通首次读卡命令*/
void Order_SztReadCardOnce(void)
{
  uint8_t data[24];
  uint8_t i;
  uint8_t temp=0;

  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;

 
  delay_us(5);
  
  SztFixData(0x00,0x11,T_SztReadCardOnce); //必须要发送的数据
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];		  //把必须要发送的数据写入数组中
  }

  
  data[21] = SztReadCardTime;
  	
  
  for(i=0;i<17;i++)			 //计算要校验的数据的和
  {
    temp = temp + data[5+i];
  }

  data[22] = 0 - temp;		   //求检验码，此数+要校验的数据的和 = 0
  data[23] = SztSendData.dataend;	   //结束码
  //printf(" %x ",data[21]);
  
  

  for(i=0;i<24;i++)			 //发送深圳通操作员登录命令
  {
    //USART_ClearFlag(USART2,USART_FLAG_TC);
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
  /*
  for(i=0;i<24;i++)
  {
     printf(" %x ",data[i]);
  }
  */
}



/*发送深圳通再次读卡命令*/
void Order_SztReadCardAgain(void)
{
  uint8_t data[24];
  uint8_t i;
  uint8_t temp=0;

  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;

 
  delay_us(5);
  
  SztFixData(0x00,0x11,T_SztReadCardAgain); //必须要发送的数据
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];		  //把必须要发送的数据写入数组中
  }

  
  data[21] = SztReadCardTime;
  	
  
  for(i=0;i<17;i++)			 //计算要校验的数据的和
  {
    temp = temp + data[5+i];
  }

  data[22] = 0 - temp;		   //求检验码，此数+要校验的数据的和 = 0
  data[23] = SztSendData.dataend;	   //结束码
  //printf(" %x ",data[21]);
  
  

  for(i=0;i<24;i++)			 //发送深圳通操作员登录命令
  {
    //USART_ClearFlag(USART2,USART_FLAG_TC);
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
  /*
  for(i=0;i<24;i++)
  {
     printf(" %x ",data[i]);
  }
  */
}




/*发送深圳通断开连接命令*/
void Order_SztUnlink(void)
{
  uint8_t data[23];
  uint8_t i;
  uint8_t temp=0;

  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;

 
  delay_us(5);
  
  SztFixData(0x00,0x10,T_SztUnlink); //必须要发送的数据
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];		  //把必须要发送的数据写入数组中
  }
  
  for(i=0;i<16;i++)			 //计算要校验的数据的和
  {
    temp = temp + data[5+i];
  }

  data[21] = 0 - temp;		   //求检验码，此数+要校验的数据的和 = 0
  data[22] = SztSendData.dataend;	   //结束码
  //printf(" %x ",data[21]);
  
  

  for(i=0;i<23;i++)			 //发送设备状态查询命令
  {
    //USART_ClearFlag(USART2,USART_FLAG_TC);
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
  /*
  for(i=0;i<23;i++)
  {
     printf(" %x ",data[i]);
  }
  */
}



/*深圳通自主签到等命令，子命令参数为0x03*/
void Order_SztAutoCheckIn(void)
{
  uint8_t data[24];
  uint8_t i;
  uint8_t temp=0;

  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;

 
  delay_us(5);
  
  SztFixData(0x00,0x11,T_SztCheck_In); //必须要发送的数据
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];		  //把必须要发送的数据写入数组中
  }

  data[21] = 0x03;
  
  for(i=0;i<17;i++)			 //计算要校验的数据的和
  {
    temp = temp + data[5+i];
  }

  data[22] = 0 - temp;		   //求检验码，此数+要校验的数据的和 = 0
  data[23] = SztSendData.dataend;	   //结束码
  //printf(" %x ",data[21]);
  
  

  for(i=0;i<24;i++)			 //发送深圳通操作员登录命令
  {
    //USART_ClearFlag(USART2,USART_FLAG_TC);
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
  /*
  for(i=0;i<24;i++)
  {
     printf(" %x ",data[i]);
  }
  */
}




/*深圳通自主参数下载命令，子命令参数为0x01*/
void Order_SztAutoDownload(void)
{
  uint8_t data[24];
  uint8_t i;
  uint8_t temp=0;

  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;

 
  delay_us(5);
  
