jackeyjiang/STM32_DGUS/STM32_Demo/utilities/szt_Gpboc/szt_gpboc.c
  SztFixData(0x00,0x11,T_SztCheck_In); //必须要发送的数据
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];		  //把必须要发送的数据写入数组中
  }

  data[21] = 0x01;
  
  for(i=0;i<17;i++)			 //计算要校验的数据的和
  {
    temp = temp + data[5+i];
  }

  data[22] = 0 - temp;		   //求检验码，此数+要校验的数据的和 = 0
  data[23] = SztSendData.dataend;	   //结束码
  //printf(" %x ",data[21]);
  
  

  for(i=0;i<24;i++)			 //发送深圳通操作员登录命令
  {
    //USART_ClearFlag(USART2,USART_FLAG_TC);
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
  /*
  for(i=0;i<24;i++)
  {
     printf(" %x ",data[i]);
  }
  */
}



/*深圳通自主上传数据命令，子命令参数为0x02*/
void Order_SztAutoSendData(void)
{
  uint8_t data[24];
  uint8_t i;
  uint8_t temp=0;

  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;

 
  delay_us(5);
  
  SztFixData(0x00,0x11,T_SztCheck_In); //必须要发送的数据
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];		  //把必须要发送的数据写入数组中
  }

  data[21] = 0x02;
  
  for(i=0;i<17;i++)			 //计算要校验的数据的和
  {
    temp = temp + data[5+i];
  }

  data[22] = 0 - temp;		   //求检验码，此数+要校验的数据的和 = 0
  data[23] = SztSendData.dataend;	   //结束码
  //printf(" %x ",data[21]);
  
  

  for(i=0;i<24;i++)			 //发送深圳通操作员登录命令
  {
    //USART_ClearFlag(USART2,USART_FLAG_TC);
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
  /*
  for(i=0;i<24;i++)
  {
     printf(" %x ",data[i]);
  }
  */
}






/*深圳通充值抵消首次命令*/
void Order_SztRechargeOnce(void)
{
  uint8_t data[30];
  uint8_t i;
  uint8_t temp=0;

  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;

 
  delay_us(5);
  
  SztFixData(0x00,0x17,T_SztRechargeOnce); //必须要发送的数据
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];		  //把必须要发送的数据写入数组中
  }

  for(i=0;i<7;i++)
  	{
  	  data[21+i] = newtime[i];
  	}
  
  for(i=0;i<23;i++)			 //计算要校验的数据的和
  {
    temp = temp + data[5+i];
  }

  data[28] = 0 - temp;		   //求检验码，此数+要校验的数据的和 = 0
  data[29] = SztSendData.dataend;	   //结束码
  //printf(" %x ",data[21]);
  
  

  for(i=0;i<30;i++)			 //发送设备状态查询命令
  {
    //USART_ClearFlag(USART2,USART_FLAG_TC);
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
  /*
  for(i=0;i<30;i++)
  {
     printf(" %x ",data[i]);
  }
  */
}



/*深圳通充值抵消再次命令*/
void Order_SztRechargeAgain(void)
{
  uint8_t data[30];
  uint8_t i;
  uint8_t temp=0;

  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;

 
  delay_us(5);
  
  SztFixData(0x00,0x17,T_SztRechargeAgain); //必须要发送的数据
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];		  //把必须要发送的数据写入数组中
  }
  
  for(i=0;i<16;i++)			 //计算要校验的数据的和
  {
    temp = temp + data[5+i];
  }
  
  for(i=0;i<7;i++)
  	{
  	  data[21+i] = newtime[i];
  	}

  data[28] = 0 - temp;		   //求检验码，此数+要校验的数据的和 = 0
  data[29] = SztSendData.dataend;	   //结束码
  //printf(" %x ",data[21]);
  
  

  for(i=0;i<30;i++)			 //发送设备状态查询命令
  {
    //USART_ClearFlag(USART2,USART_FLAG_TC);
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
  /*
  for(i=0;i<30;i++)
  {
     printf(" %x ",data[i]);
  }
  */
}






/*银联初始化签到命令*/
void Order_Gpboc_Init(void)
{
  uint8_t data[55];	//48个长度，其中32个为数据参数,从0到20为固定数，21到52为32个输入参数，53为校验码，54为结束标志
  uint8_t i;
  //sendorderDef senddata;
  uint8_t temp=0;


  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;
  GpbocSamNum[0] = 0xff;
  GpbocSamNum[1] = 0xff;
  GpbocSamNum[2] = 0xff;
  GpbocSamNum[3] = 0xff;
  
  delay_us(5);

  GpbocFixData(0x00,0x30,T_GpbocCheck_In); 
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];
  }
  
  for( i=0;i<32;i++)
  {
    data[i+21] = Gpboc_Init_PutInParameter[i];
  }

  for(i=0;i<48;i++)
  {
    temp = temp + data[5+i];
  }
 // senddata.Dcs= 0 - temp;
  data[53] = 0 - temp;//senddata.Dcs;
  data[54] = SztSendData.dataend;
  //printf("校验码为： %x \n",data[53]);
  /*
  for(i=0;i<55;i++)
  	{
  	  printf(" %x ",data[i]);
  	}
	*/

  for(i=0;i<55;i++)
  {
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
} 



 
/*读取银联卡内的余额命令,卡设置为深圳通\银联复合卡*/
void Order_Gpboc_ReadCard (void)
{
  uint8_t data[25];	//18个长度，其中2个为数据参数,从0到20为固定数，21到22为2个输入参数，23为校验码，24为结束标志
  uint8_t i;
  sendorderDef senddata;
  uint8_t temp=0;

 
  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;

  delay_us(5);

  GpbocFixData(0x00,0x12,T_GpbocQueryReadCard); 
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];
  }
  
  data[21] = 0x02;//0x01为只读银行卡，0x02为一张卡既有深圳通又有银联功能
  data[22] = 0x00;

  for(i=0;i<18;i++)
  {
    temp = temp + data[5+i];
  }
  senddata.Dcs= 0 - temp;
  data[23] = senddata.Dcs;
  data[24] = SztSendData.dataend;
  //printf("校验码为： %x \n",data[23]);
  /*
  for(i=0;i<25;i++)
  	{
  	  printf(" %x ",data[i]);
  	}
*/

  for(i=0;i<25;i++)
  {
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
}




/*银联卡扣款命令*/
void Order_Gpboc_Deduct(uint32_t submoney)
{
  uint8_t data[28];	//21个长度，其中5个为数据参数,从0到20为固定数，21到25为32个输入参数，26为校验码，27为结束标志
  uint8_t i;
  sendorderDef senddata;
  uint8_t temp=0;

  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;
  
  delay_us(5);

  GpbocFixData(0x00,0x15,T_GpbocDeduct); 
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];
  }

  
  data[21] = submoney;//0x01;
  data[22] = submoney >>8;//0x00;
  data[23] = submoney >>16;//0x00;
  data[24] = submoney >>24; //0x00; 
  /*
  data[21] =0x01;
  data[22] =0x00;
  data[23] =0x00;
  data[24] =0x00; 
  */
  data[25] = 0x20;  // 寻卡时间，为0x00时，验卡15秒；为其它值时，分别为其所代表的值
  
  for(i=0;i<21;i++)
  {
    temp = temp + data[5+i];
  }
  senddata.Dcs= 0 - temp;
  data[26] = senddata.Dcs;
  data[27] = SztSendData.dataend;
  //printf("校验码为： %x \n",data[26]);
  /*
  for(i=0;i<28;i++)
  	{
  	  printf(" %x ",data[i]);
  	}
	*/

  for(i=0;i<28;i++)
  {
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
}




/*银联上传数据命令*/
void Order_Gpboc_SendData(void)
{
  uint8_t data[55];	//48个长度，其中32个为数据参数,从0到20为固定数，21到52为32个输入参数，53为校验码，54为结束标志
  uint8_t i;
  //sendorderDef senddata;
  uint8_t temp=0;

  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;
  
  delay_us(5);

