jackeyjiang/STM32_DGUS/STM32_Demo/utilities/szt_Gpboc/szt_gpboc.c
  GpbocFixData(0x00,0x30,T_GpbocSendData); 
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];
  }
  
  for( i=0;i<32;i++)
  {
    data[i+21] = Gpboc_SendDataParameter[i];
  }

  for(i=0;i<48;i++)
  {
    temp = temp + data[5+i];
  }
 // senddata.Dcs= 0 - temp;
  data[53] = 0 - temp;//senddata.Dcs;
  data[54] = SztSendData.dataend;
  //printf("校验码为： %x \n",data[53]);
  /*
  for(i=0;i<55;i++)
  	{
  	  printf(" %x ",data[i]);
  	}
	*/

  for(i=0;i<55;i++)
  {
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
}






/* 银联批结算、签退命令*/
void Order_Gpboc_Check_Out(void)
{
  uint8_t data[55];	//48个长度，其中32个为数据参数,从0到20为固定数，21到52为32个输入参数，53为校验码，54为结束标志
  uint8_t i;
  sendorderDef senddata;
  uint8_t temp=0;

  PrintIndex2 = 0;
  memset(PrintBuf2,0xff,640);
  Usart2Flag = NormalFlag;
  DataOver = RxNo;
  AckOver = RxNo;
  
  delay_us(5);

  GpbocFixData(0x00,0x30,T_GpbocCheck_Out); 
  for( i=0;i<21;i++)
  {
    data[i] = MustSendData[i];
  }
  
  for( i=0;i<32;i++)
  {
    data[i+21] = Gpboc_CheckOutParameter[i];
  }

  for(i=0;i<48;i++)
  {
    temp = temp + data[5+i];
  }
  senddata.Dcs= 0 - temp;
  data[53] = senddata.Dcs;
  data[54] = SztSendData.dataend;
  //printf("校验码为： %x \n",data[53]);
  /*
  for(i=0;i<55;i++)
  	{
  	  printf(" %x ",data[i]);
  	}
	*/

  for(i=0;i<55;i++)
  {
    USART_SendData(USART2,data[i]);
	while( USART_GetFlagStatus(USART2,USART_FLAG_TC) == RESET);
  }
}





/*处理设备状态查询*/
uint8_t ManageQueryStatus(void)
{
   uint8_t i;
    
   if( PrintBuf2[27] == 0x00)	 //正常
   {
      //printf("\n状态查询成功\n");

	  SztSamNum[0] = PrintBuf2[12];
	  SztSamNum[1] = PrintBuf2[13];
	  SztSamNum[2] = PrintBuf2[14];
	  SztSamNum[3] = PrintBuf2[15];
	  
      for(i=0;i<4;i++)
	  {
	    Szt_deviceInf.Device_ID[i] = PrintBuf2[28 +i];       
	  }
	   //直接16进制输出
	  //printf("\nSAMID为:%x%x%x%x",Szt_deviceInf.Device_ID[0],Szt_deviceInf.Device_ID[1],Szt_deviceInf.Device_ID[2],Szt_deviceInf.Device_ID[3]); 


	  Szt_deviceInf.Terminal_ID = PrintBuf2[32] + (PrintBuf2[33]<<8) + (PrintBuf2[34]<<16) + (PrintBuf2[35]<<24);
	  
	  //printf("\n深圳通终端编号为：%d\n",Szt_deviceInf.Terminal_ID);


	  for(i=0;i<10;i++)
	  {
	    Szt_deviceInf.SoftWare_Ver[i] = PrintBuf2[36+i];
	  }
	  /*
	  printf("\n设备软件版本号为：");
	  for(i=0;i<10;i++)
	  {
	    printf("%c",Szt_deviceInf.SoftWare_Ver[i]);
	  }
		*/

	  for(i=0;i<4;i++)
	  {
	     Szt_deviceInf.Device_Status[i] = PrintBuf2[46 +i];
	  }
	  //设备状态字

	  
	  Szt_deviceInf.Curr_RemainMoney = PrintBuf2[50] + (PrintBuf2[51]<<8) + (PrintBuf2[52]<<16) +(PrintBuf2[53]<<24);
	  
	   
	  //printf("\n当前剩余额度为:%ld\n",Szt_deviceInf.Curr_RemainMoney);


	  for(i=0;i<28;i++)
	  {
	    Szt_deviceInf.Curr_ParFileName[i] = PrintBuf2[54 +i];
	  }
	  /*
	  printf("\n当前额度参数名为：");
	  for(i=0;i<28;i++)
	  {
	     printf("%c",Szt_deviceInf.Curr_ParFileName[i]);
	  }
	  */

	  
	  Szt_deviceInf.Curr_OKRecNum = PrintBuf2[82] + (PrintBuf2[83]<<8);
	  //printf("\n当前未上传的交易记录数为：%d\n",Szt_deviceInf.Curr_OKRecNum);


	 
	  Szt_deviceInf.Curr_BadRecNum = PrintBuf2[84] + (PrintBuf2[85]<<8);
	 
	  
	  //printf("\n当前未上传的交易记录数为：%d\n",Szt_deviceInf.Curr_BadRecNum );

	  for(i=0;i<8;i++)
	  {
	     Szt_deviceInf.Curr_DeviceTime[i] = PrintBuf2[86 +i];
	  }
	  //printf("\n当前设备时钟为：%x%x年%x月%x日%x时%x分%x秒\n",Szt_deviceInf.Curr_DeviceTime[0],Szt_deviceInf.Curr_DeviceTime[1],Szt_deviceInf.Curr_DeviceTime[2],Szt_deviceInf.Curr_DeviceTime[3],Szt_deviceInf.Curr_DeviceTime[4],Szt_deviceInf.Curr_DeviceTime[5],Szt_deviceInf.Curr_DeviceTime[6]);
	  //星期可不显示，若显，如0x03表示星期三

	  /*
	  if( Szt_deviceInf.Device_Status[0] & 0x80 )
	  {
	    printf("\n当前记录满\n");
	  }
	  else
	  {
	   printf("\n当前记录未满\n"); 
	  }

	  if( Szt_deviceInf.Device_Status[0] & 0x40 )
	  {
	    printf("\n当前有未上传记录\n");
	  }
	  else
	  {
	    printf("\n当前没有未上传记录\n");
	  }


	  if( Szt_deviceInf.Device_Status[0] & 0x20 )
	  {
	    printf("\n黑名单有效存在\n");
	  }
	  else
	  {
	    printf("\n黑名单无效或不存在\n");
	  }

	  
	  if( Szt_deviceInf.Device_Status[0] & 0x10 )
	  {
	    printf("\n系统用户参数有效\n");
	  }
	  else
	  {
	     printf("\n系统用户参数无效或不存在\n");
	  }

	  if( Szt_deviceInf.Device_Status[1] & 0x08 )
	  {
	    printf("\n联机签到\n");
	  }
	  else
	  {
	    printf("\n联机签退\n");
	  }

	  if( Szt_deviceInf.Device_Status[1] & 0x04 )
	  {
	    printf("\n设备时间故障，需要同步时间\n");
	  }
	  else
	  {
	    printf("\n无设备硬件故障\n");
	  }

	  if( Szt_deviceInf.Device_Status[1] & 0x02 )
	  {
	    printf("\n额度授权正常\n");
	  }
	  else
	  {
	    printf("\n额度授权过期或无效\n");
	  }


	  if( Szt_deviceInf.Device_Status[1] & 0x01 )
	  {
	    printf("\n请求上传系统应用数据\n");
	  }
	  else
	  {
	    printf("\n无请求上传系统应用数据\n");
	  }
	  */

	   
   }
   else if( PrintBuf2[27] == 0x88)	 //错误，需要判断返回数据域的前两字节错误代码
   {
     //printf("\n状态查询失败1\n");
   }
   else if( PrintBuf2[27] == 0x51)  //重作交易
   {
     //printf("\n状态查询失败2\n");
   }
   else
   {
     //printf("\n状态查询失败3\n");
   }

   return PrintBuf2[27]+1;
}



/*解析深圳通操作员登录*/
uint8_t ManageSztUserLogin(void)
{
  uint8_t temp =0;
  if(PrintBuf2[27] == 0x00)
	{
	  //printf("\n操作员登录成功");
	}
  else if( PrintBuf2[27] == 0x88)	 //错误，需要判断返回数据域的前两字节错误代码
   {
	 printf("\n操作员登录失败1\n");
   }
   else if( PrintBuf2[27] == 0x51)	//重作交易
   {
	 //printf("\n操作员登录失败2\n");
   }
   else
   {
	 //printf("\n操作员登录失败3\n");
   }

   temp = PrintBuf2[27] +1;

   return temp;

}







/*解析深圳通时间同步,没有同步结果信息(2014.2.11)*/
uint8_t ManageSztTimeCheck(void)
{
  uint8_t temp =0;
  TimeResult = 0xff;
  if(PrintBuf2[27] == 0x00)
  	{
  	  //printf("\n时间同步成功");
	  TimeResult = PrintBuf2[27]; //2014.2.11
	  /*
	  if( TimeResult == 0x00)
	  	{
	  	  printf("\n时钟同步成功");
	  	}
	  else if( TimeResult == 0x01)
	  	{
	  	  printf("\n输入的时钟信息超前太多");
	  	}
	  else if( TimeResult == 0x02)
	  	{
	  	  printf("\n输入的时钟信息滞后太多");
	  	}
	  else if( TimeResult == 0x03)
	  	{
	  	  printf("\n输入的时钟信息无效");
	  	}
	  else if( TimeResult == 0x04)
	  	{
	  	  printf("\n时间未同步");
	  	}
	  else
	  	{
	  	  printf("\n时间同步参数错误:%d",TimeResult);
	  	}
	  	 */

	  MachineTime.Year_H = PrintBuf2[28];
	  MachineTime.Year_L = PrintBuf2[29];
	  MachineTime.Month = PrintBuf2[30];
	  MachineTime.Day = PrintBuf2[31];
	  MachineTime.Hours = PrintBuf2[32];
	  MachineTime.Minutes = PrintBuf2[33];
	  MachineTime.Senconds = PrintBuf2[34];
	  MachineTime.WeekDay = PrintBuf2[35];
	   /*
	  tmp_yy = MachineTime.Year_L;
	  tmp_m2 = MachineTime.Month;
	  tmp_dd = MachineTime.Day;
	  tmp_hh = MachineTime.Hours;
	  tmp_mm = MachineTime.Minutes;
	  tmp_ss = MachineTime.Senconds;
	  tmp_ww = MachineTime.WeekDay;
	  RTC_TimeRegulate();
*/
	 // printf("\n当前设备时钟为:%2x%2x-%x-%x %x:%x:%x",MachineTime.Year_H,MachineTime.Year_L,MachineTime.Month,MachineTime.Day,MachineTime.Hours,MachineTime.Minutes,MachineTime.Senconds);

	 //新加修改系统时间
	 tmp_yy = BCDtoDec(MachineTime.Year_L);
	 tmp_m2 = BCDtoDec(MachineTime.Month);
	 tmp_dd = BCDtoDec(MachineTime.Day);
	 tmp_hh = BCDtoDec(MachineTime.Hours);
	 tmp_mm = BCDtoDec(MachineTime.Minutes);
	 tmp_ss = BCDtoDec(MachineTime.Senconds);
	 tmp_ww = BCDtoDec(MachineTime.WeekDay);
	 //printf("\n   time:%d-%d-%d %d:%d:%d",tmp_yy,tmp_m2,tmp_dd,tmp_hh,tmp_mm,tmp_ss);
	 RTC_TimeRegulate();  
  	}
  else if( PrintBuf2[27] == 0x88)	 //错误，需要判断返回数据域的前两字节错误代码
   {
     //printf("\n时间同步失败1\n");
   }
   else if( PrintBuf2[27] == 0x51)  //重作交易
   {
     //printf("\n时间同步失败2\n");
   }
   else
   {
     //printf("\n时间同步失败3\n");
   }

   temp = PrintBuf2[27] +1;

   return temp;

