jackeyjiang/STM32_DGUS/STM32_Demo/utilities/szt_Gpboc/szt_gpboc.c
}



/*解析深圳通初次扣款*/
uint8_t ManageSztDeductOnce(void)
{
  uint8_t temp =0;
  if(PrintBuf2[27] == 0x00)
  	{
  	   //printf("\n深圳通首次扣款成功\n");
	   SztReductInf.BeginMoney = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n深圳通扣款前余额为%ld\n",SztReductInf.BeginMoney);
	   SztReductInf.EndMoney = PrintBuf2[32] + (PrintBuf2[33]<<8) + (PrintBuf2[34]<<16) + (PrintBuf2[35]<<24);
	   //printf("\n深圳通扣款后余额为%ld\n",SztReductInf.EndMoney);
	   SztReductInf.CardNum = PrintBuf2[36] + (PrintBuf2[37]<<8) + (PrintBuf2[38]<<16) + (PrintBuf2[39]<<24);
	   //printf("\n深圳通卡号为%d\n",SztReductInf.CardNum);
	   SztReductInf.TradeNum = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n深圳通本次交易序号为%d\n",SztReductInf.TradeNum);
	   SztReductInf.TACNum = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n深圳通本次交易TAC码为%d\n",SztReductInf.TACNum);
	   SztReductInf.MachineAmount = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n设备授权额度为%d\n",SztReductInf.MachineAmount);
	   SztReductInf.machineNum = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n设备终端编号为%d\n",SztReductInf.machineNum);
  	  
  	}
  else if( PrintBuf2[27] == 0x88)	 //错误，需要判断返回数据域的前两字节错误代码
   {
     //printf("\n深圳通扣款失败1\n");
   }
   else if( PrintBuf2[27] == 0x51)  //重作交易
   {
     //printf("\n深圳通扣款失败2\n");
   }
   else
   {
     //printf("\n深圳通扣款失败3\n");
   }

   temp = PrintBuf2[27] +1;

   return temp;

}





/*解析深圳通再次扣款*/
uint8_t ManageSztDeductAgain(void)
{
  uint8_t temp =0;
  if(PrintBuf2[27] == 0x00)
  	{
  	   //printf("\n深圳通首次扣款成功\n");
	   SztReductInf.BeginMoney = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n深圳通扣款前余额为%ld\n",SztReductInf.BeginMoney);
	   SztReductInf.EndMoney = PrintBuf2[32] + (PrintBuf2[33]<<8) + (PrintBuf2[34]<<16) + (PrintBuf2[35]<<24);
	   //printf("\n深圳通扣款后余额为%ld\n",SztReductInf.EndMoney);
	   SztReductInf.CardNum = PrintBuf2[36] + (PrintBuf2[37]<<8) + (PrintBuf2[38]<<16) + (PrintBuf2[39]<<24);
	   //printf("\n深圳通卡号为%d\n",SztReductInf.CardNum);
	   SztReductInf.TradeNum = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n深圳通本次交易序号为%d\n",SztReductInf.TradeNum);
	   SztReductInf.TACNum = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n深圳通本次交易TAC码为%d\n",SztReductInf.TACNum);
	   SztReductInf.MachineAmount = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n设备授权额度为%d\n",SztReductInf.MachineAmount);
	   SztReductInf.machineNum = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n设备终端编号为%d\n",SztReductInf.machineNum);
  	  
  	}
  else if( PrintBuf2[27] == 0x88)	 //错误，需要判断返回数据域的前两字节错误代码
   {
     //printf("\n深圳通扣款失败1\n");
   }
   else if( PrintBuf2[27] == 0x51)  //重作交易
   {
     //printf("\n深圳通扣款失败2\n");
   }
   else
   {
     //printf("\n深圳通扣款失败3\n");
   }

   temp = PrintBuf2[27] +1;

   return temp;

}




/*解析深圳通首次读卡*/
uint8_t ManageSztReadCardOnce(void)
{
  uint8_t temp =0;
  uint8_t i;
  if(PrintBuf2[27] == 0x00)
  	{
  	  //printf("\n深圳通首次读卡成功\n");
  	  SztCardInf.CardStatus = PrintBuf2[28];
	  //printf("\n卡状态为:%d",SztCardInf.CardStatus);
	  SztCardInf.CardNum = PrintBuf2[29] + (PrintBuf2[30]<<8) + (PrintBuf2[31]<<16) + (PrintBuf2[32]<<24);
	  //printf("\n卡号为:%d",SztCardInf.CardNum);
	  SztCardInf.CardType = PrintBuf2[33];
	  //printf("\n卡类型为:%d",SztCardInf.CardStatus);
	  SztCardInf.SztMoney = PrintBuf2[34] + (PrintBuf2[35]<<8) + (PrintBuf2[36]<<16) + (PrintBuf2[37]<<24);
	  //printf("\n深圳通当前余额为:%ld",SztCardInf.SztMoney);
	  SztCardInf.MachinMoney = PrintBuf2[38] + (PrintBuf2[39]<<8) + (PrintBuf2[40]<<16) + (PrintBuf2[41]<<24);
	  //printf("\n设备当前剩余额度为:%ld",SztCardInf.MachinMoney);
	  SztCardInf.SztDeposit = PrintBuf2[42] + (PrintBuf2[43]<<8) + (PrintBuf2[44]<<16) + (PrintBuf2[45]<<24);
	  //printf("\n深圳通押金为:%d",SztCardInf.SztDeposit);
	  for(i=0;i<4;i++)
	  	{
		  SztCardInf.SellCardDay[i] = PrintBuf2[46+i];
	  	}
	  //printf("\n深圳通出售日期为:%x%x-%x-%x",SztCardInf.SellCardDay[0],SztCardInf.SellCardDay[1],SztCardInf.SellCardDay[2],SztCardInf.SellCardDay[3]);
	  SztCardInf.GetRentsMonth = PrintBuf2[50];
	  //printf("\n卡收租月份为:%d",SztCardInf.GetRentsMonth);
	  SztCardInf.RentsNum = PrintBuf2[51] + (PrintBuf2[52]<<8) + (PrintBuf2[53]<<16) + (PrintBuf2[54]<<24);
	  //printf("\n应收租金为:%d",SztCardInf.RentsNum);
	  SztCardInf.ReturnableMoney = PrintBuf2[55] + (PrintBuf2[56]<<8) + (PrintBuf2[57]<<16) + (PrintBuf2[58]<<24);
	  //printf("\n卡可退实际金额为:%ld",SztCardInf.ReturnableMoney);
	  SztCardInf.Poundage = PrintBuf2[59] + (PrintBuf2[60]<<8) + (PrintBuf2[61]<<16) + (PrintBuf2[62]<<24);
	  //printf("\n退卡手续费为:%ld",SztCardInf.Poundage);
	  SztCardInf.NoSellCardDeposit = PrintBuf2[63] + (PrintBuf2[64]<<8) + (PrintBuf2[65]<<16) + (PrintBuf2[66]<<24);

	  //printf("\n未售卡押金为:%ld",SztCardInf.NoSellCardDeposit);
	  SztCardInf.NoSellCardMoney = PrintBuf2[67] + (PrintBuf2[68]<<8) + (PrintBuf2[69]<<16) + (PrintBuf2[70]<<24);
	  //printf("\n未售卡金额为:%ld",SztCardInf.NoSellCardMoney);
	  
  	}
  else if( PrintBuf2[27] == 0x88)	 //错误，需要判断返回数据域的前两字节错误代码
   {
     //printf("\n深圳通首次读卡失败1\n");
   }
   else if( PrintBuf2[27] == 0x51)  //重作交易
   {
     //printf("\n深圳通首次读卡失败2\n");
   }
   else
   {
     //printf("\n深圳通首次读卡失败3\n");
   }

   temp = PrintBuf2[27] +1;

   return temp;

}





/*解析深圳通再次读卡*/
uint8_t ManageSztReadCardAgain(void)
{
  uint8_t temp =0;
  uint8_t i;
  if(PrintBuf2[27] == 0x00)
  	{
  	  //printf("\n深圳通再次读卡成功\n");
  	  SztCardInf.CardStatus = PrintBuf2[28];
	  //printf("\n卡状态为:%d",SztCardInf.CardStatus);
	  SztCardInf.CardNum = PrintBuf2[29] + (PrintBuf2[30]<<8) + (PrintBuf2[31]<<16) + (PrintBuf2[32]<<24);
	  //printf("\n卡号为:%d",SztCardInf.CardNum);
	  SztCardInf.CardType = PrintBuf2[33];
	  //printf("\n卡类型为:%d",SztCardInf.CardStatus);
	  SztCardInf.SztMoney = PrintBuf2[34] + (PrintBuf2[35]<<8) + (PrintBuf2[36]<<16) + (PrintBuf2[37]<<24);
	  //printf("\n深圳通当前余额为:%ld",SztCardInf.SztMoney);
	  SztCardInf.MachinMoney = PrintBuf2[38] + (PrintBuf2[39]<<8) + (PrintBuf2[40]<<16) + (PrintBuf2[41]<<24);
	  //printf("\n设备当前剩余额度为:%ld",SztCardInf.MachinMoney);
	  SztCardInf.SztDeposit = PrintBuf2[42] + (PrintBuf2[43]<<8) + (PrintBuf2[44]<<16) + (PrintBuf2[45]<<24);
	  //printf("\n深圳通押金为:%d",SztCardInf.SztDeposit);
	  for(i=0;i<4;i++)
	  	{
		  SztCardInf.SellCardDay[i] = PrintBuf2[46+i];
	  	}
	  //printf("\n深圳通出售日期为:%x%x-%x-%x",SztCardInf.SellCardDay[0],SztCardInf.SellCardDay[1],SztCardInf.SellCardDay[2],SztCardInf.SellCardDay[3]);
	  SztCardInf.GetRentsMonth = PrintBuf2[50];
	  //printf("\n卡收租月份为:%d",SztCardInf.GetRentsMonth);
	  SztCardInf.RentsNum = PrintBuf2[51] + (PrintBuf2[52]<<8) + (PrintBuf2[53]<<16) + (PrintBuf2[54]<<24);
	  //printf("\n应收租金为:%d",SztCardInf.RentsNum);
	  SztCardInf.ReturnableMoney = PrintBuf2[55] + (PrintBuf2[56]<<8) + (PrintBuf2[57]<<16) + (PrintBuf2[58]<<24);
	  //printf("\n卡可退实际金额为:%ld",SztCardInf.ReturnableMoney);
	  SztCardInf.Poundage = PrintBuf2[59] + (PrintBuf2[60]<<8) + (PrintBuf2[61]<<16) + (PrintBuf2[62]<<24);
	  //printf("\n退卡手续费为:%ld",SztCardInf.Poundage);
	  SztCardInf.NoSellCardDeposit = PrintBuf2[63] + (PrintBuf2[64]<<8) + (PrintBuf2[65]<<16) + (PrintBuf2[66]<<24);

	  //printf("\n未售卡押金为:%ld",SztCardInf.NoSellCardDeposit);
	  SztCardInf.NoSellCardMoney = PrintBuf2[67] + (PrintBuf2[68]<<8) + (PrintBuf2[69]<<16) + (PrintBuf2[70]<<24);
	  //printf("\n未售卡金额为:%ld",SztCardInf.NoSellCardMoney);
	  
