jackeyjiang/STM32_DGUS/STM32_Demo/utilities/szt_Gpboc/szt_gpboc.c
  	}
  else if( PrintBuf2[27] == 0x88)	 //错误，需要判断返回数据域的前两字节错误代码
   {
     //printf("\n深圳通再次读卡失败1\n");
   }
   else if( PrintBuf2[27] == 0x51)  //重作交易
   {
     //printf("\n深圳通再次读卡失败2\n");
   }
   else
   {
     //printf("\n深圳通再次读卡失败3\n");
   }

   temp = PrintBuf2[27] +1;

   return temp;

}




/*解析深圳通断开连接*/
uint8_t ManageSztUnlink(void)
{
  uint8_t temp =0;
  
  if(PrintBuf2[27] == 0x00)
  	{
  	  //printf("\n断开连接成功\n");
  	}
  else if( PrintBuf2[27] == 0x88)	 //错误，需要判断返回数据域的前两字节错误代码
   {
     //printf("\n断开连接失败1\n");
   }
   else if( PrintBuf2[27] == 0x51)  //重作交易
   {
     //printf("\n断开连接失败2\n");
   }
   else
   {
     //printf("\n断开连接失败3\n");
   }
  /* */

   temp = PrintBuf2[27] +1;

   return temp;

}




/*解析深圳通自主签到、参数下载、数据上传*/
uint8_t ManageSztAutoManage(void)
{
  uint8_t temp =0;
  
  if(PrintBuf2[27] == 0x00)
  	{
  	  //printf("\n自主签到或参数下载或数据上传成功\n");
  	}
  else if( PrintBuf2[27] == 0x88)	 //错误，需要判断返回数据域的前两字节错误代码
   {
     //printf("\n自主签到或参数下载或数据上传失败1\n");
   }
   else if( PrintBuf2[27] == 0x51)  //重作交易
   {
     //printf("\n自主签到或参数下载或数据上传失败2\n");
   }
   else
   {
     //printf("\n自主签到或参数下载或数据上传失败3\n");
   }
   /**/

   temp = PrintBuf2[27] +1;

   return temp;

}




/*解析深圳通充值抵消*/
uint8_t ManageSztRechargeOnce(void)
{
  uint8_t temp =0;
  if(PrintBuf2[27] == 0x00)
  	{
  	   //printf("\n深圳通首次充值抵消成功\n");
	   SztReductInf.BeginMoney = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n深圳通扣款前余额为%ld\n",SztReductInf.BeginMoney);
	   SztReductInf.EndMoney = PrintBuf2[32] + (PrintBuf2[33]<<8) + (PrintBuf2[34]<<16) + (PrintBuf2[35]<<24);
	   //printf("\n深圳通扣款后余额为%ld\n",SztReductInf.EndMoney);
	   SztReductInf.CardNum = PrintBuf2[36] + (PrintBuf2[37]<<8) + (PrintBuf2[38]<<16) + (PrintBuf2[39]<<24);
	   //printf("\n深圳通卡号为%d\n",SztReductInf.CardNum);
	   SztReductInf.TradeNum = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n深圳通本次交易序号为%d\n",SztReductInf.TradeNum);
	   SztReductInf.TACNum = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n深圳通本次交易TAC码为%d\n",SztReductInf.TACNum);
	   SztReductInf.MachineAmount = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n设备授权额度为%d\n",SztReductInf.MachineAmount);
	   SztReductInf.machineNum = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n设备终端编号为%d\n",SztReductInf.machineNum);
  	}
  else if( PrintBuf2[27] == 0x88)	 //错误，需要判断返回数据域的前两字节错误代码
   {
     //printf("\n失败1\n");
   }
   else if( PrintBuf2[27] == 0x51)  //重作交易
   {
     //printf("\n状态查询失败2\n");
   }
   else
   {
     //printf("\n状态查询失败3\n");
   }

   temp = PrintBuf2[27] +1;

   return temp;

}





/*解析深圳通充值抵消*/
uint8_t ManageSztRechargeAgain(void)
{
  uint8_t temp =0;
  if(PrintBuf2[27] == 0x00)
  	{
  	   //printf("\n深圳通再次充值抵消成功\n");
	   SztReductInf.BeginMoney = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n深圳通扣款前余额为%ld\n",SztReductInf.BeginMoney);
	   SztReductInf.EndMoney = PrintBuf2[32] + (PrintBuf2[33]<<8) + (PrintBuf2[34]<<16) + (PrintBuf2[35]<<24);
	   //printf("\n深圳通扣款后余额为%ld\n",SztReductInf.EndMoney);
	   SztReductInf.CardNum = PrintBuf2[36] + (PrintBuf2[37]<<8) + (PrintBuf2[38]<<16) + (PrintBuf2[39]<<24);
	   //printf("\n深圳通卡号为%d\n",SztReductInf.CardNum);
	   SztReductInf.TradeNum = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n深圳通本次交易序号为%d\n",SztReductInf.TradeNum);
	   SztReductInf.TACNum = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n深圳通本次交易TAC码为%d\n",SztReductInf.TACNum);
	   SztReductInf.MachineAmount = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n设备授权额度为%d\n",SztReductInf.MachineAmount);
	   SztReductInf.machineNum = PrintBuf2[28] + (PrintBuf2[29]<<8) + (PrintBuf2[30]<<16) + (PrintBuf2[31]<<24);
	   //printf("\n设备终端编号为%d\n",SztReductInf.machineNum); 
  	}
  else if( PrintBuf2[27] == 0x88)	 //错误，需要判断返回数据域的前两字节错误代码
   {
     //printf("\n失败1\n");
   }
   else if( PrintBuf2[27] == 0x51)  //重作交易
   {
     //printf("\n状态查询失败2\n");
   }
   else
   {
     //printf("\n状态查询失败3\n");
   }

   temp = PrintBuf2[27] +1;

   return temp;

}




/*解析银联初始化签到*/
uint8_t ManageGpbocInit(void)
{
  uint8_t i;
  uint8_t j;

  if( PrintBuf2[27] == 0x00)	 //正常
   {
     //printf("\n银联签到成功\n");
	 GpbocSamNum[0] = PrintBuf2[12];
	 GpbocSamNum[1] = PrintBuf2[13];
	 GpbocSamNum[2] = PrintBuf2[14];
	 GpbocSamNum[3] = PrintBuf2[15];

	 

	 UpInitErrNum[0] = PrintBuf2[28];	 
	 UpInitErrNum[1] = PrintBuf2[29];
	 
	 UpInitGpbocErrNum[0] = PrintBuf2[30];
	 UpInitGpbocErrNum[1] = PrintBuf2[31];

	 for(j=0;j<10;j++)
	 	{
		 	 UpInitData[j].ucLogInLogVersion = PrintBuf2[32 + j*34];
			 UpInitData[j].ucAcqBankNum = PrintBuf2[33 + j*34];
			 UpInitData[j].ucLogInOK = PrintBuf2[34 + j*34];
			 UpInitData[j].ucOper = PrintBuf2[35 + j*34];
			 UpInitData[j].ucKeyMode = PrintBuf2[36 + j*34];
			 
			 UpInitData[j].lBatchNumber = PrintBuf2[37 + j*34] + (PrintBuf2[38 + j*34]<<8) + (PrintBuf2[39 + j*34]<<16) + (PrintBuf2[40 + j*34]<<24);
			 
			 for(i=0;i<9;i++)
			 	{
			 	  UpInitData[j].szPosId[i] = PrintBuf2[41 +i + j*34] ;
			 	}

			 for(i=0;i<16;i++)
			 	{
			 	  UpInitData[j].szMerchantId[i] = PrintBuf2[50 +i + j*34];
			 	}
	 	}
	 /*
	 printf("\n结构体版本号为:%d\n",UpInitData[0].ucLogInLogVersion);
	 printf("\n收单行号:%d\n",UpInitData[0].ucAcqBankNum);
	 printf("\n签到成功标志:%d\n",UpInitData[0].ucLogInOK);
	 printf("\n操作员:%d\n",UpInitData[0].ucOper);
	 printf("\n签到密钥类型，(0表示双倍长；1表示单倍长):%c\n",UpInitData[0].ucKeyMode);
	 
	 printf("\n批次号为:%d\n",UpInitData[0].lBatchNumber);
	 printf("\n\nPOS终端号为:");
	 for(i=0;i<9;i++)
	 {
	   printf("%c",UpInitData[0].szPosId[i]);
	 }
	 delay_us(5);
	 printf("\n\n商户号为:");
	 for(i=0;i<16;i++)
	 {
	   printf("%c",UpInitData[0].szMerchantId[i]);
	 }
	   */

   }
  
