jackeyjiang/STM32_DGUS/STM32_Demo/utilities/szt_Gpboc/szt_gpboc.c
    else if( PrintBuf2[27] == 0x88)  //错误，需要判断返回数据域的前两字节错误代码
	 {
	   //printf("\n银联签到失败1\n");
	 }
	 else if( PrintBuf2[27] == 0x51)  //重作交易
	 {
	  //printf("\n银联签到失败2\n");
	 }
	 else
	 {
	   //printf("\n银联签到失败3\n");
	 }


	 return PrintBuf2[27]+1;
  
}






/*解析查询银联卡余额*/
uint8_t ManageGpbocReadCard(void)
{
  uint8_t i;
  uint8_t temp=0;
  
  
  if( PrintBuf2[27] == 0x00)	 //正常
   {
     //printf("\n银联读取余额成功\n");

	 //以下为把接收到的数存到对应的数组中
	 UpInitErrNum[0] = PrintBuf2[28];	 
	 UpInitErrNum[1] = PrintBuf2[29];
	 
	 UpInitGpbocErrNum[0] = PrintBuf2[30];
	 
	 UpInitGpbocErrNum[1] = PrintBuf2[31];

	 UpReadCardData.SztStatus = PrintBuf2[32];
	 
	 UpReadCardData.SztNum = PrintBuf2[33] + (PrintBuf2[34]<<8) + (PrintBuf2[35]<<16) + (PrintBuf2[36]<<24);
	 
	 UpReadCardData.SztMoney = PrintBuf2[37] + (PrintBuf2[38]<<8) + (PrintBuf2[39]<<16) + (PrintBuf2[40]<<24);
	 //printf("\ncard money is %ld",UpReadCardData.SztMoney);
	 
	 for(i=0;i<64;i++)
	 	{
	 	  UpReadCardData.SztReserve[i] = PrintBuf2[41+i];
	 	}
	 /*
	 if( UpReadCardData.SztStatus ==0 )
	 	{
	 	  printf("\n不存在深圳通数据\n");
	 	}
	 else if (UpReadCardData.SztStatus == 0x03)
	 	{
	 	  printf("\n深圳通为正常卡\n");
	 	}
	 else if( UpReadCardData.SztStatus == 0x09)
	 	{
	 	  printf("\n深圳通为黑名单卡\n");
	 	}
	 else if( UpReadCardData.SztStatus == 0x07)
	 	{
	 	  printf("\n深圳通为回收卡\n");
	 	}
	 else 
	 	{
	 	  printf("\n深圳通无效\n");
	 	}

	 if(UpReadCardData.SztStatus != 0x00)
	 	{
	 	  printf("\n深圳通卡号为:%d\n",UpReadCardData.SztNum);
		  
		  printf("\n深圳通余额为:%ld\n",UpReadCardData.SztMoney);		
	 	}
	  */

	 

	 UpReadCardData.GpbocStatus = PrintBuf2[105];
	 if( UpReadCardData.GpbocStatus != 0)
	 {
		 for(i=0;i<20;i++)
		 	{
		 	  UpReadCardData.GpbocNum[i] = PrintBuf2[106+i];
		 	}
			/*
		 printf("\n银联卡号为:");
		 for(i=0;i<20;i++)
			{
			  printf("%c",UpReadCardData.GpbocNum[i]);
			}
			  */
		 
		 UpReadCardData.GpbocMoney = PrintBuf2[126] +(PrintBuf2[127]<<8) + (PrintBuf2[128]<<16) + (PrintBuf2[129]<<24);
		 
		 
		 for(i=0;i<64;i++)
		 	{
		 	  UpReadCardData.GpbocReserve[i] = PrintBuf2[130+i];
		 	}
			delay_us(5);
		//printf("\n银联卡内余额为:%ld\n",UpReadCardData.GpbocMoney);
		 /*
		 if( UpReadCardData.GpbocStatus != 0)
		 	{
		 	  printf("\n银联卡号为:");
			  for(i=0;i<20;i++)
			  	{
			  	  printf("%c",UpReadCardData.GpbocNum[i]);
			  	}
		
			  delay_us(5);
		
			  printf("\n银联卡内余额为:%ld\n",UpReadCardData.GpbocMoney);
		 	}
		 else
		 	{
		 	  printf("\n不存在银联数据\n");
		 	}
		   */
		 }
		 else 
		 {
		   //printf("\n不存在银联数据");
		 }
   }
  
  else if( PrintBuf2[27] == 0x88)  //错误，需要判断返回数据域的前两字节错误代码
	 {
	   //printf("\n银联读卡查询余额失败1\n");
	 }
  else if( PrintBuf2[27] == 0x51)  //重作交易
	 {
	   //printf("\n银联读卡查询余额失败1\n");
	 }
  else
	 {
	   //printf("\n银联读卡查询余额失败1\n");
	 }
  temp = PrintBuf2[27] +1;

  //printf("printBuf2[27]= %x",temp);
  
  
  return temp;
}





//uint32_t BackupsIndex;
/*解析扣款返回数据*/
uint8_t ManageGpbocDeduct(void)
{
  uint8_t i;
  uint32_t temp=0;
  if( PrintBuf2[27] == 0x00)	 //正常
   {
     //printf("\n银联扣款成功");

	 //以下为把接收到的数存到对应的数组中
	 UpInitErrNum[0] = PrintBuf2[28];	 
	 UpInitErrNum[1] = PrintBuf2[29];
	 
	 UpInitGpbocErrNum[0] = PrintBuf2[30];
	 UpInitGpbocErrNum[1] = PrintBuf2[31];


	 UpDeductData.ucLogVersion = PrintBuf2[32];
	 //printf("\n银联扣款结构体版本号为:%d\n",UpDeductData.ucLogVersion);
	 
	 UpDeductData.ucAcqBankNum = PrintBuf2[33];
	 //printf("\n银联扣款收单行号为:%d\n",UpDeductData.ucAcqBankNum);
	 
	 UpDeductData.iTransNo = PrintBuf2[34] + (PrintBuf2[35]<<8) + (PrintBuf2[36]<<16) + (PrintBuf2[37]<<24);
	 //printf("\n银联扣款交易号为:%ld\n",UpDeductData.iTransNo);
	  
	 UpDeductData.ucBlklistFail = PrintBuf2[38];
	 //printf("\n银联扣款黑名单卡标志为:%d\n",UpDeductData.ucBlklistFail);
	 
	 UpDeductData.ucqPBOCSaleFail = PrintBuf2[39];
	 //printf("\n银联扣款交易失败标志为:%d\n",UpDeductData.ucqPBOCSaleFail);
	 
	 UpDeductData.ucqPBOCLastRd = PrintBuf2[40];
	 //printf("\n银联扣款读最后一条记录失败标志为:%d\n",UpDeductData.ucqPBOCLastRd);
	 
	 UpDeductData.ucOfflineSaleFail = PrintBuf2[41];
	 //printf("\n银联扣款脱机交易拒绝标志为:%d\n",UpDeductData.ucOfflineSaleFail);
	 
	 UpDeductData.lTransAmount = PrintBuf2[42] + (PrintBuf2[43]<<8) + (PrintBuf2[44]<<16) + (PrintBuf2[45]<<24);
	 //printf("\n银联本次交易金额为:%ld\n",UpDeductData.lTransAmount);
	 
	 UpDeductData.lCardBalance = PrintBuf2[46] + (PrintBuf2[47]<<8) + (PrintBuf2[48]<<16) + (PrintBuf2[49]<<24);
	 //printf("\n银联卡内EC余额为:%ld\n",UpDeductData.lCardBalance);
	 
	 UpDeductData.lTraceNo = PrintBuf2[50] + (PrintBuf2[51]<<8) + (PrintBuf2[52]<<16) + (PrintBuf2[53]<<24);
	 //printf("\n银联扣款流水号为:%ld\n",UpDeductData.lTraceNo);
	 
	 UpDeductData.lBatchNumber = PrintBuf2[54] + (PrintBuf2[55]<<8) + (PrintBuf2[56]<<16) + (PrintBuf2[57]<<24);
	 //printf("\n银联扣款批次号为:%ld\n",UpDeductData.lBatchNumber);
	 
	 for(i=0;i<9;i++)
	 	{
	 	  UpDeductData.szPosId[i] = PrintBuf2[58+i];
	 	}
		/*
	 printf("\nPOS终端号为:");
	 for(i=0;i<9;i++)
	 	{
	 	  printf("%c",UpDeductData.szPosId[i]);
	 	}
		  */
	 
	 for(i=0;i<21;i++)
	 	{
	 	  UpDeductData.szCardNo[i] = PrintBuf2[67+i];
	 	}
		/*
	 printf("\n卡号为:");
	 for(i=0;i<21;i++)
	 	{
	 	  printf("%c",UpDeductData.szCardNo[i]);
	 	}
		  */
	 
	 for(i=0;i<9;i++)
	 	{
	 	  UpDeductData.szDate[i] = PrintBuf2[88+i];
	 	}
		/*
	 printf("\n\n银联扣款日期为:");
	 for(i=0;i<9;i++)
	 	{
	 	  printf("%c",UpDeductData.szDate[i]);
	 	}
		  */
	 
	 for(i=0;i<7;i++)
	 	{
	 	  UpDeductData.szTime[i] = PrintBuf2[97+i];
	 	}
		/*
	 printf("\n银联扣款时间为:");	 
	 for(i=0;i<7;i++)
	 	{
	 	  printf("%c",UpDeductData.szTime[i]);
	 	}
		  */
	 
	 for(i=0;i<5;i++)
	 	{
	 	  UpDeductData.szExpDate[i] = PrintBuf2[104+i];
	 	}
		/*
	 printf("\n\n银联扣款EXp日期为:");	 
	 for(i=0;i<5;i++)
	 	{
	 	  printf("%c",UpDeductData.szExpDate[i]);
	 	}
		  */

	 
	 for(i=0;i<4;i++)
	 	{
	 	  UpDeductData.szTellerNo[i] = PrintBuf2[109+i];
	 	}
		/*
	 printf("\n银联扣款操作员为:");
	 
	 for(i=0;i<4;i++)
	 	{
	 	  printf("%c",UpDeductData.szTellerNo[i]);
	 	}
		  */

	 
	 for(i=0;i<4;i++)
	 	{
	 	  UpDeductData.szCardUnit[i] = PrintBuf2[113+i];
	 	}
		/*
	 printf("\n银联卡所属组织为:");
	 
	 for(i=0;i<4;i++)
	 	{
	 	  printf("%c",UpDeductData.szCardUnit[i]);
	 	}
		  */
	 
	 
	 UpDeductData.BkDataLen = PrintBuf2[117] + (PrintBuf2[118]<<8) + (PrintBuf2[119]<<16) + (PrintBuf2[120]<<24);
	 //UpDeductData.BkDataLen = PrintBuf2[104] + (PrintBuf2[105]<<8);
	  //printf("\n备份交易数据的长度为:%ld",UpDeductData.BkDataLen);

