jackeyjiang/STM32_DGUS/STM32_Demo/utilities/szt_Gpboc/szt_gpboc.c
	 // 备份数据保存
	 
	 for(temp =0;temp<UpDeductData.BkDataLen;temp++)
	 	{
	 	 // UpDedectBackup[temp] = PrintBuf2[121 + temp];  //unit32
		  // UpDedectBackup[temp] = PrintBuf2[121 + temp];   //uint16
	 	}
	   
	   delay_us(100);
	  //printf("\n备份交易数据完成");
	 
   }
  else if( PrintBuf2[27] == 0x88)  //错误，需要判断返回数据域的前两字节错误代码
	 {
	   //printf("\n银联扣款失败1\n");
	   //return 0x88;
	 }
  else if( PrintBuf2[27] == 0x51)  //重作交易
	 {
	    //printf("\n银联扣款失败2\n");
		//return 0x51;
	 }
  else
	 {
	   // printf("\n银联扣款失败3\n");  

		
	 }

   //printf("printBuf2[27]= %x",PrintBuf2[27]);
  return PrintBuf2[27]+1;
  
	//return 0x00;
}




/*解析银联上传数据*/
uint8_t ManageGpbocSendData(void)
{
  uint8_t i;
  uint8_t temp=0xff ;
  if( PrintBuf2[27] == 0x00)	 //正常
   {
     //printf("\n银联上传数据成功\n");

	 UpInitErrNum[0] = PrintBuf2[28];	 
	 UpInitErrNum[1] = PrintBuf2[29];
	 
	 UpInitGpbocErrNum[0] = PrintBuf2[30];
	 UpInitGpbocErrNum[1] = PrintBuf2[31];

	 UpSendData.ucUpLogVersion = PrintBuf2[32];
	  //printf("\n银联上传数据的结构体版本号为:%d\n",UpSendData.ucUpLogVersion);
	  
	 UpSendData.ucAcqBankNum = PrintBuf2[33];
	 //printf("\n银联上传数据的收单行号为:%d\n",UpSendData.ucAcqBankNum);
	 
	 UpSendData.ucUploadOK = PrintBuf2[34];
	 //printf("\n银联上传数据的签到成功标志为:%d\n",UpSendData.ucUploadOK);
	 
	 UpSendData.lBatchNumber = PrintBuf2[35]+ (PrintBuf2[36]<<8) + (PrintBuf2[37]<<16) + (PrintBuf2[38]<<24);
	 //printf("\n银联上传数据的批次号为:%d\n",UpSendData.lBatchNumber);

	 
	 UpSendData.lTotalNum = PrintBuf2[39] + (PrintBuf2[40]<<8) + (PrintBuf2[41]<<16) + (PrintBuf2[42]<<24);
	 //printf("\n需要上送文件中的总笔数为:%d\n",UpSendData.lTotalNum);

	 
	 UpSendData.lToUploadNum = PrintBuf2[43] + (PrintBuf2[44]<<8) + (PrintBuf2[45]<<16) + (PrintBuf2[46]<<24);
	 //printf("\n真正需要上送的总笔数:%d\n",UpSendData.lToUploadNum);

	 
	 UpSendData.lSuccNum = PrintBuf2[47] + (PrintBuf2[48]<<8) + (PrintBuf2[49]<<16) + (PrintBuf2[50]<<24);
	 //printf("\n成功上送的笔数:%d\n",UpSendData.lSuccNum);

	 
	 UpSendData.lSuccTotalAmt = PrintBuf2[51] + (PrintBuf2[52]<<8) + (PrintBuf2[53]<<16) + (PrintBuf2[54]<<24);
	 //printf("\n成功上送的总金额:%d",UpSendData.lSuccTotalAmt);

	 
	 UpSendData.lFailNum = PrintBuf2[55] + (PrintBuf2[56]<<8) + (PrintBuf2[57]<<16) + (PrintBuf2[58]<<24);
	 //printf("\n上送失败的总笔数:%d",UpSendData.lFailNum);

	 
	 UpSendData.lFailTotalAmt = PrintBuf2[59] + (PrintBuf2[60]<<8) + (PrintBuf2[61]<<16) + (PrintBuf2[62]<<24);
	 //printf("\n上送失败的总金额:%d",UpSendData.lFailTotalAmt);

	 
	 for(i=0;i<9;i++)
	 	{
	 	   UpSendData.szPosId[i] = PrintBuf2[63+i];
	 	}
		/*
	 printf("\nPOS终端号为:");
	 for(i=0;i<9;i++)
	 	{
	 	  printf("%c",UpSendData.szPosId[i]);
	 	}
		  */
	 

	 for(i=0;i<16;i++)
	 	{
	 	   UpSendData.szMerchantId[i] = PrintBuf2[72+i];
	 	}
		/*
	 printf("\n\n商户号为:");
	 for(i=0;i<16;i++)
	 	{
	 	  printf("%c",UpSendData.szMerchantId[i]);
	 	}
		  */
		 
   }
  else if( PrintBuf2[27] == 0x88)  //错误，需要判断返回数据域的前两字节错误代码
	 {
	   //printf("\n银联上传记录失败1\n");
	 }
  else if( PrintBuf2[27] == 0x51)  //重作交易
	 {
	   //printf("\n银联上传记录失败2\n");
	 }
  else
	 {
	   //printf("\n银联上传记录失败3\n");
	 }

  temp = PrintBuf2[27]+1; 
  return temp;

}







/*解析银联批结、签退*/
uint8_t ManageGpbocCheckOut(void)
{
  uint8_t i;
  if( PrintBuf2[27] == 0x00)	 //正常
   {
     //printf("\n银联批结签退成功\n");

	 UpInitErrNum[0] = PrintBuf2[28];	 
	 UpInitErrNum[1] = PrintBuf2[29];
	 
	 UpInitGpbocErrNum[0] = PrintBuf2[30];
	 UpInitGpbocErrNum[1] = PrintBuf2[31];

	 UpCheckOutData.ucLogInLogVersion = PrintBuf2[32];
	 //printf("\n银联批结签退的结构体版本号为:%d\n",UpCheckOutData.ucLogInLogVersion);
	 
	 UpCheckOutData.ucAcqBankNum = PrintBuf2[33];
	 //printf("\n银联批结签退的收单行号为:%d\n",UpCheckOutData.ucAcqBankNum);
	 
	 UpCheckOutData.ucLogInOK = PrintBuf2[34];
	  //printf("\n银联批结签退的签到成功标志为:%d\n",UpCheckOutData.ucLogInOK);
	  
	 UpCheckOutData.ucOper = PrintBuf2[35];
	  //printf("\n银联批结签退的操作员号为:%d\n",UpCheckOutData.ucOper);
	  
	 UpCheckOutData.ucKeyMode = PrintBuf2[36];
	 //printf("\n银联批结签退所用的密钥类型为:%c\n",UpCheckOutData.ucKeyMode);
	 
	 UpCheckOutData.lBatchNumber = PrintBuf2[37] + (PrintBuf2[38]<<8) + (PrintBuf2[39]<<16) + (PrintBuf2[40]<<24);
	 //printf("\n银联批结签退的批次号为:%d\n",UpCheckOutData.lBatchNumber);
	 
	 for(i=0;i<9;i++)
	 {
		UpCheckOutData.szPosId[i] = PrintBuf2[41+i];
	 }
	 /*
	 printf("\nPOS终端号为:");
	 for(i=0;i<9;i++)
	 	{
	 	  printf("%c",UpCheckOutData.szPosId[i]);
	 	}
	   */
	 

     for(i=0;i<16;i++)
	 {
		UpCheckOutData.szMerchantId[i] = PrintBuf2[50+i];
	 }
	 /*
	 printf("\n\n商户号为:");
	 for(i=0;i<16;i++)
	 	{
	 	  printf("%c",UpCheckOutData.szMerchantId[i]);
	 	}
	   */

   }
  else if( PrintBuf2[27] == 0x88)  //错误，需要判断返回数据域的前两字节错误代码
	 {
	   //printf("\n银联批结、签退失败1\n");
	 }
  else if( PrintBuf2[27] == 0x51)  //重作交易
	 {
	    //printf("\n银联批结、签退失败2\n");
	 }
  else
	 {
	    //printf("\n银联批结、签退失败3\n");
	 }

  return PrintBuf2[27]+1;

}




/*测试*/
void ManageGpbocAll(uint8_t PutInNum)
{
  uint8_t orderFlag;
  
  if( PutInNum ==1 )
  {
    printf("PutInNum =1");
    Order_Ifn_QueryStatus();
  }
  else if( PutInNum == 2)
  {
    printf("PutInNum =2");
    Order_Gpboc_Init();
  }
  else if( PutInNum == 3)
  {
    printf("PutInNum =3");
    Order_Gpboc_ReadCard();
  }
   else if( PutInNum == 4)
  {
    printf("PutInNum =4");
    Order_Gpboc_Deduct(1);
  }
    else if( PutInNum == 5)
  {
    printf("PutInNum =5");
    Order_Gpboc_SendData();
  }
	 else if( PutInNum == 6)
  {
    printf("PutInNum =6");
    Order_Gpboc_Check_Out();
  }
  else
  {
    //printf("\nOver");
  }
  
  
  orderFlag = ManageReOrderType();
  if( orderFlag == 0)
  	{
  	  //printf("\n错误，错误标志为:1\n");
  	}
  else if( orderFlag == R_QueryStatus)
  	{
  	  ManageQueryStatus();
  	}
  else if( orderFlag == R_GpbocCheck_In)
  	{
  	  ManageGpbocInit();
  	}
  else if( orderFlag == R_GpbocReadCard)
  	{
  	  ManageGpbocReadCard();
  	}
  else if( orderFlag == R_GpbocDeduct)
  	{
  	  ManageGpbocDeduct();
  	}
  else if( orderFlag == R_GpbocSendData)
  	{
  	  ManageGpbocSendData();
  	}
  else if( orderFlag == R_GpbocCheck_Out)
  	{
  	  ManageGpbocCheckOut();
  	}
  else
  {
    //printf("\n错误，错误标志为:%d\n",orderFlag);
  }
  //PrintIndex2 = 0;
  //PrintBuf2[0] = 0xff;

  //Close_Szt_Gpboc();

  
