jackeyjiang/STM32_DGUS/STM32_Demo/utilities/szt_Gpboc/szt_gpboc.c
}




/*银联签到,成功返回1，失败返回0*/
uint8_t Gpboc_CheckIn (void)
{
  uint8_t temp;
  
  uint8_t flag1 =0;
  uint8_t flag2 =0;
  uint8_t flag3 =0;
  uint8_t flag4 =0;
  
  uint8_t result_End = 0;
  
  Order_Ifn_QueryStatus();
  temp = 0xff;
  temp = ManageReOrderType();
  if( temp == R_QueryStatus)
  	{
  	  flag1 = ManageQueryStatus();
  	}
  delay_us(50);

  if( flag1 == 0x01)
  	{
  	  Order_Gpboc_Init();
	  temp = 0xff;
	  temp = ManageReOrderType();
	  if( temp == R_GpbocCheck_In)
	  	{
	  	  flag2 = ManageGpbocInit();
	  	}

		//printf("\n银联初始化标志=%x",flag2);
		delay_ms(1000);

	  if(flag2 == 0x01)
	  	{
	  	  Order_Gpboc_SendData();
		  delay_ms(1000);
		  temp = 0xff;
		  temp = ManageReOrderType();
		  if( temp == R_GpbocSendData)
		  	{
		  	  flag3 = ManageGpbocSendData();
			  
		  	}
		  //printf("\n银联上传标志=%x",flag3);
		  delay_ms(1000);
		  if( flag3 == 0x01)
		  	{
		  	  Order_Gpboc_Check_Out();
			  delay_ms(1000);
			  temp = 0xff;
			  temp = ManageReOrderType();
			  if( temp == R_GpbocCheck_Out)
			  	{
			  	  flag4 = ManageGpbocCheckOut();
			  	}
		  	}
		   	//printf("\n银联签退标志=%x",flag4);
		}

	  delay_ms(1000);
	  if( flag4 == 0x01)
	  	{
	  	  Order_Gpboc_Init();
		  temp = 0xff;
		  temp = ManageReOrderType();
		  if( temp == R_GpbocCheck_In)
		  	{
		  	  result_End = ManageGpbocInit();
		  	}
	  	}
  	}

	return result_End;
  
  
}




/*银联只验卡不消费, 成功验卡返回1，失败返回0*/
uint8_t OnlyReadGpbocCard(void)
{
  uint8_t orderFlag1;
  uint8_t result1 =0;
  uint8_t endreturn =0;
  Order_Gpboc_ReadCard();
  orderFlag1 = ManageReOrderType();
  if( orderFlag1 == R_GpbocReadCard)
  	{
  	  result1 = ManageGpbocReadCard();
  	}

  if( result1 == 1)
  {
    endreturn =1;
  }

  return endreturn;
  
}



/*银联卡消费,返回0表示扣款失败；返回1表示扣款正确*/
uint8_t GpbocDeduct(uint32_t money_deduct)
{
  uint8_t orderFlag1 =0;
  uint8_t result1 =0;
  uint8_t result2 =0;
  int32_t FristMoney=0;
//   int32_t EndMoney=0;
//   int32_t FactMoney;
  //TRANSLOG_TO_HOST saveDeductIfn;


  //初次验卡
  UpDeductData.lTransAmount = 0;	  //设扣款初始为0

  Order_Gpboc_ReadCard();
  orderFlag1 = ManageReOrderType();
  if( orderFlag1 == R_GpbocReadCard)
  	{
  	  result1 = ManageGpbocReadCard();
  	}

  if( result1 == 0x01)          //验卡成功
  	{
  	  FristMoney = UpReadCardData.GpbocMoney;
// 	    EndMoney = FristMoney;
      
      if( FristMoney < money_deduct )
      {
        //printf("\n卡内余额为%ld",FristMoney);
        printf("卡内余额不足，请先充值\r\n");
        return 0;
      }
      else
      {
        orderFlag1 =0;
	  	  Order_Gpboc_Deduct(money_deduct);
        orderFlag1 = ManageReOrderType();

        if(orderFlag1 == R_GpbocDeduct)
          {
            result2 = ManageGpbocDeduct();
          }
          
        if( result2 == 1)   //付款成功
        {
          printf("付款成功\r\n");
          return 1;
        }
        else
        {
          printf("付款失败\r\n");
          return 0;
        }
      }
  	}
    else
    {
      printf("读卡失败\r\n");
      return 0;
    }

}






/*上送银联数据，成功上送返回1，失败返回0*/
uint8_t UpperGpboc(void)
{
  uint8_t orderFlag;
  uint8_t result1;
  uint8_t endresult =0;
  Order_Gpboc_SendData();
  orderFlag = ManageReOrderType();
  if( orderFlag == R_GpbocSendData)
  	{
  	  result1 = ManageGpbocSendData();
  	}
  else
  	{
  	  endresult= 0;  	  
  	}

  if(result1 == 1)
  	{
  	  //printf("\n上送银联数据成功\n");
  	  endresult =1;
  	}
  else
  	{
  	  //printf("\n上送银联数据失败\n");
  	  endresult =0;
  	}

  return endresult;
}



/*银联批结流程，成功批结返回1，失败返回0*/
uint8_t GpbocVout(void)
{
  uint8_t orderFlag;
  uint8_t result1;
  uint8_t endresult =0;
  Order_Gpboc_Check_Out();
  orderFlag = ManageReOrderType();
  if( orderFlag == R_GpbocCheck_Out)
  	{
  	  result1 = ManageGpbocCheckOut();
  	}
  else
  	{
  	  endresult= 0;  	  
  	}

  if(result1 == 1)
  	{
  	  //printf("\n银联批结、签退成功\n");
  	  endresult =1;
  	}
  else
  	{
  	  //printf("\n银联批结、签退失败\n");
  	  
  	  endresult =0;
  	}

  return endresult;
}


void TestSzt(uint8_t PutInNum)
{
  uint8_t orderFlag;

  if( PutInNum ==1 )
  {
    //printf("PutInNum =1");
    Order_Ifn_QueryStatus();
  }
  else if( PutInNum == 2)
  {
    //printf("PutInNum =2");
    Order_SztUserLogin(); //登录
  }
  else if( PutInNum == 3)
  {
    //printf("PutInNum =3");
    Order_SztTimeCheck(); //时间同步
  }
   else if( PutInNum == 4)
  {
    //printf("PutInNum =4");
    Order_SztAutoCheckIn();  //自主签到
  }
    else if( PutInNum == 5)
  {
    //printf("PutInNum =5");
    Order_SztAutoDownload();  //自主下载参数
  }
	else if( PutInNum == 6)
  {
    //printf("PutInNum =6");
    Order_SztAutoSendData();  //自主上传数据
  }
	else if( PutInNum == 7)
  {
    //printf("PutInNum =7");
    Order_SztUnlink();  //自主上传数据
  }
	else if( PutInNum == 8)
  {
    //printf("PutInNum =8");
    //Order_SztReadCardOnce();  //首次读卡
    Order_Gpboc_ReadCard();
  }
	else if( PutInNum == 9)
  {
    //printf("PutInNum =8");    
    Order_SztDeductOnce(1); //初次扣款
  }
	else if( PutInNum == 10)
  {
    //printf("PutInNum =8");    
    Order_SztDeductAgain(1); //初次扣款
  }
  else
  {
    //printf("\nOver");
  }
  
  
  orderFlag = ManageReOrderType();
  if( orderFlag == 0)
  	{
  	  //printf("\n错误，错误标志为:1\n");
  	}
  else if( orderFlag == R_QueryStatus)
  	{
  	  ManageQueryStatus();
  	}
  else if( orderFlag == R_UserLogin)
  	{
  	  ManageSztUserLogin();
  	}
  else if( orderFlag == R_TimeCheck)
  	{
  	  ManageSztTimeCheck();
  	}
  else if( orderFlag == R_SztCheck_In)
  	{
  	  ManageSztAutoManage();
  	}
  else if( orderFlag == R_SztUnlink)
  	{
  	  ManageSztUnlink();
  	}
  else if( orderFlag == R_GpbocReadCard)
  	{
  	  ManageGpbocReadCard();
  	}  
  else if( orderFlag == R_SztDeductOnce)
  	{
  	  ManageSztDeductOnce();
  	} 
  else if( orderFlag == R_SztDeductAgain)
  	{
  	  ManageSztDeductAgain();
  	} 
  else
  {
    //printf("\n错误，错误标志为:%d\n",orderFlag);
  }
}



/*深圳通签到，成功返回1，失败返回0*/
uint8_t Szt_CheckIn(void)
{
  uint8_t flag1 =0;//状态查询
  uint8_t flag2 =0;//时间校验
  uint8_t flag3 =0;//操作员登录
  uint8_t flag4 =0;//深圳通自主签到
  uint8_t flag5 =0;//深圳通自主下载参数
  uint8_t flag6 =0;//深圳通自主上传数据
  uint8_t flag7 =0;//总签到成功与否标志
  uint8_t temp =0xff;

