jackeyjiang/STM32_DGUS/STM32_Demo/utilities/szt_Gpboc/szt_gpboc.c
  Order_Ifn_QueryStatus();
  delay_us(10);
  temp = ManageReOrderType();
  if( temp == R_QueryStatus)
  	{
  	  flag1 = ManageQueryStatus();	  
  	}

  if(flag1 == 1)
  	{
	/**/
  	Order_SztTimeCheck();
	  delay_us(5);
	  temp = 0xff;
	  temp = ManageReOrderType();
	  if( temp == R_TimeCheck )
	  	{
	  	  flag2 = ManageSztTimeCheck();
	  	}
	  
	  Order_SztUserLogin();
	  delay_us(5);
	  temp = 0xff;
	  temp = ManageReOrderType();
	  if( temp == R_UserLogin )
	  	{
	  	  flag3 = ManageSztUserLogin();
	  	}

  	}
  
  if((flag1 == 1) && ( flag2 == 1) && ( flag3 ==1))
  	{
  	  Order_SztAutoCheckIn();
	  temp = 0xff;
	  temp = ManageReOrderType();
	  if( temp == R_SztCheck_In)
	  	{
	  	  flag4 = ManageSztAutoManage();			  
	  	}

	  if( flag4 == 1)
	  	{
		  Order_SztAutoDownload();
		  temp = 0xff;
		  temp = ManageReOrderType();
		  if( temp == R_SztCheck_In)
		    {
			  flag5 = ManageSztAutoManage();				
		    }


		  Order_SztAutoSendData();
		  temp = 0xff;
		  temp = ManageReOrderType();
		  if( temp == R_SztCheck_In)
		    {
			  flag6 = ManageSztAutoManage();				
		    }
	  	}
  	}

  if( (flag1 ==1) && (flag2 ==1) && (flag3 ==1) && (flag4 ==1) && (flag5 ==1) && (flag6 ==1))
  	{
  	  flag7 = 1;  //全部内容都返回正确，签到过程才成功
  	}

  return flag7;
}


 

/*深圳通扣款*/
uint8_t SztDeduct(int32_t money)
{
  uint8_t temp ;
  uint8_t flag0 =0;
  uint8_t flag1 =0;
  uint8_t flag2 =0;
  uint8_t flag3 =0;
  uint8_t flag4 = 0;
  uint8_t endflag =0;
  uint8_t FristMoney =0;
  uint8_t EndMoney =0;
  int32_t TrueMoney=0;

  SztReductInf.BeginMoney =0;
  SztReductInf.EndMoney =0;

  //初次验卡
  Order_Gpboc_ReadCard();
  temp = 0xff;
  temp = ManageReOrderType();
  if( temp == R_GpbocReadCard)
  	{
  	  flag0 = ManageGpbocReadCard();
  	}

  if( flag0 == 0x01)
  	{
  	  FristMoney = UpReadCardData.SztMoney;
	  EndMoney = FristMoney;
  	}

  
  if( flag0 == 1) //验卡成功
  	{
  	  Order_SztDeductOnce(money); //扣款
	  delay_us(15);
	  temp = 0xff;
	  temp = ManageReOrderType(); 
	  if( temp == R_SztDeductOnce)
	  	{
	  	  flag1 = ManageSztDeductOnce();

		  if( flag1 == 1)
		  	{
		  	  flag3 = 1;
		  	}
		  else if( flag1 == 0x52 )  //重操作扣款
		  	{
		  	  Order_SztDeductAgain(money);
			  delay_us(15);
			  temp = 0xff;
			  temp = ManageSztDeductAgain();
			  if( temp == R_SztDeductAgain )
			  	{
			  	  flag2 = ManageSztDeductAgain();

				  if( flag2 == 1)
				  	{
				  	  flag3 = 1;
				  	}
			  	}
		  	}
		  else
		  	{
		  	  
		  	}
	  	}

	  if( flag3 == 1) 
	  {
	      if( (SztReductInf.BeginMoney - SztReductInf.EndMoney ) == money )
		  {
		    return 1;
		  }
		  else
		  {
		     //再次验卡
			  Order_Gpboc_ReadCard();
		      temp = 0xff;
			  temp = ManageReOrderType();
			  if( temp == R_GpbocReadCard)
			  	{
			  	  flag4 = ManageGpbocReadCard();
			  	}
	
			  if( flag4 == 0x01)
			  	{
			  	  EndMoney= UpReadCardData.SztMoney;
			  	}
		  }
	  }

	  

	  
  	}

  if( (flag4 == 0x01) &&(flag3 == 0x01))
  	{
  	  TrueMoney = FristMoney - EndMoney;
	  if( TrueMoney == money)
	  	{
	  	  endflag = 1;
	  	}
  	}

  return endflag;
  
}





/*深圳通上传数据，上传成功返回1，失败返回0*/
uint8_t SztAutoSend(void)
{
  uint8_t temp =0xff;
  uint8_t flag1 = 0x00;

  Order_SztAutoSendData();
  temp = ManageReOrderType();
  if( temp == R_SztCheck_In)
  	{
  	  flag1 = ManageSztAutoManage();	  
  	}

  return flag1;
}



/*深圳通签到*/
bool Szt_GpbocAutoCheckIn(void)
{
  uint8_t Szt_DiverInitFlag =0;
  uint8_t Gpboc_DiverInitFlag =0;
  uint16_t check_cont=0;
  while(1)	 
  {
    if( Gpboc_DiverInitFlag ==0)
 	  {
 	    delay_us(500);
 	    Gpboc_DiverInitFlag = Gpboc_CheckIn();
 	  }
	  if( Gpboc_DiverInitFlag == 1)
	  {
			check_cont=0;
	    break;
	  }
		else 
		{
			check_cont++;
			if(check_cont>1000)
				return false;
		}
  }  
  while(1)	 
  {
    if( Szt_DiverInitFlag ==0)
 	  {
 	    delay_us(500);
 	    Szt_DiverInitFlag = Szt_CheckIn();
 	  }
	  if(Szt_DiverInitFlag == 1)
	  {
		  break;
	  }
		else 
		{
			check_cont++;
			if(check_cont>1000)
				return false;
		}
  }
	return true;
}

/*一个2位的BCD码转换成一个十进制码*/
uint8_t  BCDtoDec(uint8_t bcd)  
{  
     uint8_t i, tmp; 
   
     for(i=0; i<2; i++)  
     {  
        tmp = ((bcd>>4) & 0x0F)*10 + (bcd & 0x0F); 
     }  
   
     return tmp;  
}  
   


/*一个2位的十进制数转换成一个BCD码*/ 
uint8_t DectoBCD(uint8_t Dec)  
{  
     uint8_t temp;

	 temp = Dec/10*16 + Dec%10;
   
     return temp;  
}  






